<a href="https://colab.research.google.com/github/Jeongyoon-Jang/SOLUX_summer_data/blob/master/1%EC%A3%BC%EC%B0%A8/%ED%8C%90%EB%8B%A4%EC%8A%A4_%EA%B8%B0%EC%B4%88_6(7%EC%9B%9427%EC%9D%BC).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [8]:
import pandas as pd
friends = [{'age': 15, 'job': 'student'},
           {'age': 25, 'job': 'developer'},
           {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friends,
                  index = ['John', 'Jenny', 'Nate'],
                  columns = ['age','job'])

In [9]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [10]:
df.drop(['John', 'Nate']) #John과 Nate 정보 삭제

       age        job
Jenny   25  developer

In [11]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [12]:
df = df.drop(['John', 'Nate']) #삭제된 정보를 데이터프레임에 저장

In [13]:
df

       age        job
Jenny   25  developer

In [29]:
df = pd.DataFrame(friends,
                  index = ['John', 'Jenny', 'Nate'],
                  columns = ['age','job'])

In [30]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [31]:
df.drop(['John', 'Nate'], inplace = True)
# inplace라는 명령어를 넣으면 drop한 value가 데이터프레임에 적용됨

In [32]:
df

       age        job
Jenny   25  developer

In [33]:
friends = [{'name': 'John','age': 15, 'job': 'student'},
           {'name': 'Ben','age': 25, 'job': 'developer'},
           {'name': 'Jenny','age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friends,
                  columns = ['name','age','job'])

In [34]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [36]:
df = df.drop(df.index[[0,2]]) # John과 Jenny 삭제

In [37]:
df

  name  age        job
1  Ben   25  developer

In [38]:
df = pd.DataFrame(friends,
                  columns = ['name','age','job'])

In [39]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [40]:
df = df[df.age>20] #20살 이상인 정보 갖기

In [41]:
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [42]:
#column drop하기

In [43]:
df = pd.DataFrame(friends,
                  columns = ['name','age','job'])

In [44]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [45]:
df = df.drop('age', axis=1) #column 중에서 age 드랍시키기

In [46]:
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

In [47]:
df = pd.DataFrame(friends,
                  columns = ['name','age','job'])

In [48]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [50]:
df.drop('age', axis=1, inplace = True)

In [51]:
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher